/* Copyright (c) 2014, ENEA Software AB
 * Copyright (c) 2014, Nokia
 * All rights reserved.
 *
 * SPDX-License-Identifier:	BSD-3-Clause
 */
 
#ifndef __OSPK_UDP_FWD_H__
#define __OSPK_UDP_FWD_H__

/*----------------------------------------------*
 *宏定义                             *
 *----------------------------------------------*/


/*----------------------------------------------*
 *结构体定义                             *
 *----------------------------------------------*/
    

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/
void *udp_fwd_start(void *sock_arg);

#endif /*__OSPK_UDP_FWD_H__*/

